Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Other open source packages that the specific software component interacts with or depends on, especially if they are governed by a different open source license
ja: 特に、異なるオープン ソース ライセンスによって許諾されているような場合で、特定のソフトウェア コンポーネントが相互作用するか、または依存するような、他のオープン ソース パッケージ。

source: Other open source that the specific software component interacts with or depends on, especially if it is governed by a different open source license
ja: 特に別のオープン ソース ライセンスで許諾されているような場合、特定のソフトウェア コンポーネントと相互作用する、または依存関係にある、別のオープン ソース

source: Other reasons: each depends on the specifics of the software component in question and its usage model in the final commercial product or service.
ja: その他の理由：それぞれのケースは、問題となっているソフトウェア コンポーネントの個別条件や、最終製品やサービスでの利用形態に依存します。

source: Other than the license information, which for OSS components are usually available in a COPYING or a LICENSE file, you need to capture copyright and attribution notices as well.
ja: 通常COPYING, LICENSEファイルに含まれているOSSコンポーネントに関するライセンス情報以外にも、著作権や帰属情報を入手することが必要です。

source: Outgoing license(s) = ?
ja: 出るライセンス = ?

source: Output
ja: アウトプット

source: Outreach and support of open source organizations: Such activities are important to help the company build relationships with open source organizations, understand the roles of these organizations, and contribute to their efforts where it makes sense .
ja: オープンソースの組織への参加 やサポート。こうした活動は企業がオープンソースの組織との関係を確立し、そうした組織の役割を理解し、有意義な貢献をするのを助けます。

source: Outside and in-house legal costs
ja: 外部・内部のリーガルコスト

source: Outside and in-house legal costs .
ja: 外部・内部のリーガルコスト

source: Outsourced Development
ja: 開発の外部委託

source: Over time, companies started to incorporate open source software into their platforms and software stacks due to the advantages it offers.
ja: 時と共に企業はOSSを自社のプラットフォームやソフトウェア スタックに組み込み、その恩恵に与かるようになってきました。

source: Oversee the closure of all issues identified by scanning tools
ja: スキャンのツールで特定されたすべての問題の解決を監督

source: Oversee the closure of all issues identified by scanning tools .
ja: スキャンのツールで特定されたすべての問題が解決することを監督 .

source: POLICY
ja: ポリシー

source: POLICY 78
ja: ポリシー 78

source: PRACTICAL LEGAL ADVICE
ja: 実際的な法務アドバイス

source: PRACTICAL LEGAL ADVICE 137
ja: 実際的な法務アドバイス 137

source: PREFACE
ja: 序文（Preface）

source: PROCESS
ja: プロセス

source: PROCESS 79
ja: プロセス 79

source: PROCESS STAGES’ INPUTS AND OUTPUTS
ja: プロセスの各ステージにおけるインプットとアウトプット

source: PROCESS STAGES’ INPUTS AND OUTPUTS 83
ja: プロセスの各ステージにおけるインプットとアウトプット 83

source: Package name and version
ja: パッケージ名とバージョン

source: Packages can be downloaded and uncompressed on an external computer without error
ja: パッケージは、外部コンピュータでエラー無しにダウンロードして圧縮解凍できる。

source: Packages can be downloaded and uncompressed on an external computer without error .
ja: パッケージは、外部コンピュータでエラー無しにダウンロードして圧縮解凍できる。

source: Packages have been uploaded correctly
ja: パッケージは、正しくアップロードされている。

source: Packages have been uploaded correctly .
ja: パッケージは、正しくアップロードされている。

source: Participant
ja: 参加者

source: Participant Primary Roles and Responsibilities
ja: 参加者 主な役割と責任

source: Participants need expertise to train them how to collaborate with their competitors in an effective manner.
ja: 参加者は、効果的な方法で、自分の競争者といかに協力するかについてのトレーニングを必要としています。

source: Participants want to share their code and IP, and they need a trusted neutral home for IP assets (trademark, copyright, patents).
ja: 参加者は、コードとIPを共有することを望み、IP資産（商標、著作権、特許）のための、信頼のおける中立的な管理場所を必要としています。

source: Participate in OSRB and OSEC
ja: OSRBとOSECへ参加

source: Participate in engineering design reviews, code inspections, and distribution readiness assessments to assure that the engineering and product teams follow all compliance processes and policies and conform to the approved OSRB usage form
ja: エンジニアリング チームによる設計のレビュー、コードの検査、配布可能化の評価に参加し、エンジニアリングおよび製品チームがコンプライアンスの全プロセスとポリシーに従っていること、OSRB承認済の利用申請書類に適合することを確認します。

source: Participate in engineering design reviews, code inspections, and distribution readiness assessments to assure that the engineering and product teams follow all compliance processes and policies and conform to the approved OSRB usage form .
ja: エンジニアリングチームによる設計のレビュー、コードの検査、配布可能化の評価に参加し、エンジニアリングおよび製品チームがコンプライアンスの全プロセスとポリシーに従っていること、OSRB承認済の利用申請書類に適合することを確認します。

source: Participation in open source events and conferences: Participation can be at various levels ranging from sponsoring an event, to contributing presentations and publications, or simply sending developers to attend and meet open source developers and foster new relationships with open source community members
ja: オープンソースのイベントや会議への参加。参加には様々なレベルがある。イベントのスポンサーから講演や出版物への寄与、あるいは単に開発者を参加させオープンソースの開発者たちと知り合いオープンソース コミュニティのメンバと新たな関係を育成します。

source: Perform a linguistic review to ensure that there are no inappropriate comments in the source code.
ja: ソース コードに不適切なコメントが残っていないことを確実にするために、リンギスティック レビューを実施します。

source: Perform a scan of the source code.
ja: ソース コードのスキャンを実施します。

source: Perform analysis of components flagged by the scanning tool.
ja: スキャン ツールでフラグがつけられたコンポーネントの分析を実施します。

source: Perform architectural reviews to verify if and how open source license obligations are extending to proprietary and third-party software components
ja: アーキテクチャを評価し、オープンソースのライセンス上の義務がプロプラエタリやサードパーティのソフトウェア コンポーネントまで拡大していないか、拡大しているならばどのように、を検証

source: Perform architectural reviews to verify if and how open source license obligations are extending to proprietary and third-party software components .
ja: アーキテクチャを評価し、オープンソースのライセンス上の義務がプロプラエタリやサードパーティのソフトウェアコンポーネントまで拡大していないか、拡大しているならばどのように、を検証

source: Perform architectural reviews: As part of the approval process, the OSRB performs architecture review with Engineering representative to analyze the interaction between open source code, proprietary code, and third-party source code.
ja: アーキテクチャのレビュー実行。承認過程の一つとして、OSRBはエンジニアリング部門の代表と共にアーキテクチャをレビューし、オープンソースのソースコード、プロプラエタリのコード 、サードパーティのソースコードの関係を解析します。

source: Perform code inspections as part of the pre-distribution verification, to ensure that open source license text and copyright notices have been kept intact and that engineers have updated the change logs to reflect the changes introduced to the source code.
ja: 配布前の検証作業の一環としてコードの検査を実施。オープンソース ライセンスのテキストや著作権表示が完全な形となっており、ソースコードに対して施された変更を反映するようエンジニアたちが変更ログ をアップデートしていることを確認

source: Perform linkage analysis review: The OSRB also performs a linkage analysis to determine if any open source license obligations propagate to proprietary or third-party software through linking (from API calls, etc.).
ja: リンク解析をレビュー。OSRBはAPI呼び出し等によるリンク関係により、何らかのオープンソースのライセンス上の義務がプロプラエタリやサードパーティのソフトウェアに広がっていないかの確認のためリンク解析を行います。

source: Perform software audits: The OSRB performs audits on all software included in a product, which involves the following tasks:
ja: ソフトウェアの監査の実施：OSRBは製品に含まれる全ソフトウェアについて監査を行います。これは下記が含まれます。

source: Perform software audits: The OSRB performs audits on all software included in a product, which involves the following tasks: .
ja: ソフトウェアの監査の実施：OSRBは製品に含まれる全ソフトウェアについて監査を行う。これは下記が含まれます。

source: Performing final verifications in relation to distribution
ja: 頒布に関連した最終検証の実施

source: Performing verification of all previous steps prior to distribution
ja: 頒布前の上記全段階の検証

source: Periodic full-platform scans should also take place every few weeks to ensure that no open source software component has been included into the platform without a corresponding OSRB form.
ja: 定期的な全プラットフォーム スキャンは、対応するOSRBフォーム無しにプラットフォームへソフトウェア コンポーネントが入らないことを確実にするために、数週間に1回程度実施されるべきです。

source: Permissive open source licenses often fall under this category.
ja: 許容型オープン ソース ライセンスは、しばしばこのカテゴリに分類されます。

source: Plan a complete compliance infrastructure to meet your long- term goals, and then implement the pieces stepwise, as needed for short-term execution.
ja: 長期的な目標に合致する、十全なコンプライアンスのインフラストラクチャーを計画し、短期的な実行の必要性に合わせ、要素を一つずつ実装します。

source: Plan a complete compliance infrastructure to meet your long-term goals, and then implement the pieces stepwise, as needed for short-term execution.
ja: 長期的な目標に合致する、十全なコンプライアンスのインフラストラクチャーを計画し、短期的な実行の必要性に合わせ、要素を一つずつ実装します。

source: Please note that these different scenarios are provided for illustration purposes only.
ja: これらの異なるシナリオは、説明目的のみに提示されています。

source: Please note that these phases are for illustration purposes and may not be exactly the same as the ones in your specific scenario.
ja: これらのフェーズは、説明目的のものであって、実際のシナリオとは正確には一致しないかもしれません。

source: Please note that this playbook is provided for illustration purposes only and its content should not be considered definitive.
ja: このプレーブックは、説明目的で書かれたものであり、その中身は確実と考えないように注意して下さい

source: Policies and Processes
ja: ポリシーとプロセス

source: Policies and Processes 32
ja: ポリシーとプロセス 32

source: Post-Publication Checklist
ja: 一般公開後のチェックリスト

source: Post-Publication Checklist 107
ja: 一般公開後のチェックリスト107

source: Practical advice from Legal Counsel to software developers may include:
ja: 法務担当からソフトウェア開発者に向けた実際的なアドバイスは、以下を含むかもしれません

source: Pre-Conditions for Distribution
ja: 頒布の前提条件

source: Pre-Conditions for Distribution The following is a list of conditions that should be met before source code packages are ready for distribution (aka distribution hygiene):
ja: 頒布の前提条件 以下は、ソース コード パッケージが頒布可能になる前に、適合しておくべき条件リストです。（頒布の衛生とも呼ばれます）

source: Pre-Distribution Checklist
ja: 頒布前チェックリスト

source: Pre-Distribution Checklist 105
ja: 頒布前チェックリスト 105

source: Pre-Distribution Verifications
ja: 頒布前検証

source: Pre-Distribution Verifications The next step in the compliance due diligence is to decide on the method and mode of distribution, type of packages to distribute, and mechanism of distribution.
ja: 頒布前検証 コンプライアンス精査の次のステップは、頒布の方法とモード、頒布するパッケージのタイプ、および頒布メカニズムを決定することです。

source: Pre-Distribution Verifications 75
ja: 頒布前検証 75

source: Pre-Distribution Verifications phase outcome
ja: 頒布前検証フェーズの結果

source: Pre-Distribution Verifications phase outcome .
ja: 頒布前検証フェーズの結果

source: Pre-Distribution Verifications phase prerequisite
ja: 頒布前検証フェーズの前提条件

source: Pre-approved Licenses
ja: 事前承認ライセンス

source: Prepare software packages for distribution
ja: 配布のためのソフトウェア パッケージ準備

source: Prepare source code packages for distribution: Engineering teams prepare the source code packages that will be made available on a public website as part of meeting open source license obligations (other source code distribution methods are discussed in a later chapter).
ja: 配布のためのソースコード パッケージを準備：エンジニアリング チームはライセンスの義務に従って公開のウェブサイトで利用可能とするソースコード パッケージを準備します（これ以外のソースコードの配布方法については後ろの章で論じます）

source: Preparing the source code packages for external distribution
ja: 外部頒布のためにソース コード パッケージの準備をします。

source: Preparing the source code packages for external distribution .
ja: 外部頒布のためにソース コード パッケージの準備をします。

source: Presentation of Attributions
ja: 帰属の提示

source: Presentation of Attributions 133
ja: 帰属の提示 133

source: Preserving Original License, Copyright, and Attribution
ja: オリジナルのライセンス、著作権、帰属情報を維持する

source: Primary Roles and Responsibilities
ja: 主な役割と責任

source: Primary roles and responsibilities of the compliance core team (OSRB)
ja: コンプライアンス コアチーム (OSRB) の主な役割と責任

source: Primary roles and responsibilities of the compliance extended team
ja: コンプライアンス拡大チームの役割と責任

source: Prior to joining Samsung, Haddad was a member of the management team at The Linux Foundation responsible for technical and legal compliance projects and initiatives.
ja: Samsungに加わる前、ハダッドはLinux Foundationの経営チームにおいて技術と法務コンプライアンス プロジェクトとイニシアティブの責任者でした。

source: Prior to triggering the process, you need to decide on the method and mode of providing source.
ja: プロセスを開始させる前に、ソース提供の方法と様式を決めなければなりません。

source: Problem Type
ja: 問題の類型

source: Process Failures
ja: コンプライアンス プロセス上の失敗

source: Process Failures 26
ja: コンプライアンスプロセス上の失敗 26

source: Process failures can lead to infringement of the open source licensing terms such as the inability to meet the license obligations.
ja: コンプライアンス プロセス上の失敗は、オープンソースのライセンス条件の侵害、例えばライセンス上の義務を満たさない、に繋がる。

source: Process of responding to compliance inquiries
ja: コンプライアンスに関する照会へ対応するプロセス

source: Processes and policies are important; however, they have to be light and efficient so that development teams do not regard them as overly burdensome to the development process.
ja: プロセスとポリシー は重要です。しかし開発プロセスにとって重荷に過ぎると開発チームが見做さないよう軽く効果的でなければなりません。

source: Processes are detailed specifications as to how a company will implement these rules on a daily basis.
ja: プロセスとは、日々の業務にこれらルール群を実装するかを詳細に列挙したものです。

source: Produce final auditing report.
ja: 最終監査報告を作成します。

source: Product implementation includes only approved open source components and licenses.
ja: 製品実装は、承認されたオープン ソース コンポーネントとライセンスのみを含む。

source: Product must fulfill open source licensing obligations prior to customer receipt.
ja: 製品は、顧客が受け取る前に、オープン ソース ライセンス義務を実施しておく必要があります。

source: Prohibited Licenses
ja: 禁止されたライセンス

source: Project Management Tools
ja: プロジェクト管理ツール

source: Project Management Tools 118
ja: プロジェクト管理ツール 118

source: Project management tools
ja: プロジェクト管理ツール

source: Project management tools .
ja: プロジェクト管理ツール

source: Proposed Solutions
ja: 解決策

source: Proprietary code, developed by the company building the product/service
ja: プロプラエタリなコード、その製品やサービスを作る企業が開発したもの

source: Proprietary code, developed by the company building the product/service .
ja: プロプラエタリなコード、その製品やサービスを作る企業が開発したもの

source: Proprietary code, originally developed by the company under an open source license in the process of integrating and deploying open source components, but was not contributed back to the upstream open source project
ja: プロプラエタリなコード、元々はその企業によりオープンソースのライセンス下でオープンソースのコンポーネントを統合したり適用したりすることで開発されたが、上流のオープンソースプロジェクトに寄付されず戻されなかったもの

source: Proprietary code, originally developed by the company under an open source license in the process of integrating and deploying open source components, but was not contributed back to the upstream open source project .
ja: プロプラエタリなコード、元々はその企業によりオープンソースのライセンス下でオープンソースのコンポーネントを統合したり適用したりすることで開発されたが、上流のオープンソースプロジェクトに寄付されず戻されなかったもの

source: Proprietary components
ja: プロプライエタリ コンポーネント

source: Proprietary components .
ja: プロプライエタリ コンポーネント

source: Proprietary software committed into the source code repository system
ja: ソース コード リポジトリへ提出されるプロプライエタリ ソフトウェア

source: Proprietary software committed into the source code repository system .
ja: ソース コード リポジトリへ提出されるプロプライエタリ ソフトウェア

source: Proprietary software created by internal developers, which may include snippets of open source or which integrates open source at the component level, with dependencies on or links to open source code
ja: 内部開発者によって作られたプロプライエタリ ソフトウェア。オープン ソースのコード断片を含んでいるかもしれません。コンポーネント レベルでオープン ソース コードと依存関係を持ったり、リンクされたりして、オープン ソースと統合されているかもしれません。

source: Proprietary software created by internal developers, which may include snippets of open source or which integrates open source at the component level, with dependencies on or links to open source code .
ja: 内部開発者によって作られたプロプライエタリ ソフトウェア。オープン ソースのコード断片を含んでいるかもしれません。コンポーネント レベルでオープン ソース コードと依存関係を持ったり、リンクされたりして、オープン ソースと統合されているかもしれません。

source: Proprietary source code must not link to an open source library that has a derivative work obligation.
ja: プロプライエタリ ソース コードは、派生物への義務を持つようなオープン ソース ライブラリにリンクしてはいけません。

source: Protecting proprietary intellectual property (and consequently product differentiation) by ensuring that open source license obligations do not propagate to proprietary or third party software
ja: プロプラエタリな知財（引いては製品の差異化）を、オープンソースのライセンスがプロプラエタリな、またはサードパーティのソフトウェアに確かに及ばないようにすることで防御

source: Provide additional notices in product publications.
ja: 製品説明に告知を追加

source: Provide approval regarding the use of open source in products or services
ja: 製品やサービスでのオープンソースの利用を承認

source: Provide approval regarding the use of open source in products or services The approval of the Legal Counsel is required when using open source in a commercial product.
ja: 製品やサービスでのオープンソースの利用を承認 オープンソースを商用製品に用いる時には法律顧問の承認が必要です。

source: Provide guidance on licensing
ja: ライセンスについてのガイドラインの提供

source: Provide guidance on open source questions coming from company staff and engineers.
ja: 社内のスタッフやエンジニアから寄せられるオープンソースに関する質問に対しガイダンスを提供

source: Provide proper level of staffing so as not to fall behind in the audit schedule
ja: 適切なレベルのスタッフを揃え、監査がスケジュール遅れとならないようにする

source: Provide proper training to compliance staff
ja: コンプライアンスのスタッフを適切に訓練

source: Provide recommendations and guidance to engineering teams on open source questions and concerns.
ja: エンジニアリング チームからのオープンソースについての質問や懸念に対し勧告したり、ガイダンスを提供したりします。

source: Provide support and maintenance for the tools and automation infrastructure used by the compliance program
ja: コンプライアンス プログラムで利用されるツールと自動化のインフラをサポートし整備

source: Provide training around open source licenses, company policies, and guidelines.
ja: オープンソースのライセンス、企業のポリシー、ガイドラインに関わる訓練を提供

source: Providing files missing from open source packages made available as part of license obligations
ja: ライセンス義務の一環として入手可能になっているオープン ソース パッケージにおいて、抜けているファイルの提供

source: Publish licensing notice on company website.
ja: ライセンス告知を企業のウェブサイトに掲載

source: RECOMMENDATIONS
ja: 推奨事項

source: RECOMMENDED PRACTICES FOR COMPLIANCE PROCESS MANAGEMENT
ja: コンプライアンス プロセス管理の推奨プラクティス

source: REFINING COMPLIANCE PROCESSES
ja: コンプライアンス プロセスの改善

source: RESPONDING TO COMPLIANCE INQUIRIES
ja: コンプライアンスに関する照会への対応

source: RESPONDING TO COMPLIANCE INQUIRIES 122
ja: コンプライアンスに関する照会への対応 122

source: Rather, the individuals who initiate the project chose a given open source license, and once a project reaches a certain scale, the licenses are virtually impossible to change.
ja: そうではなく、オープンソースプロジェクトを開始した人々が所定のライセンスを選びます。そしてプロジェクトがある規模に達すると、変更は事実上不可能となります。

source: Re-introduce the newer version of the software component in the compliance process
ja: コンプライアンス プロセスにおいて、より新しいバージョンのソフトウェア コンポーネントを再導入

source: Realize that inquirers often don’t fully understand licenses, leading to mistaken assumptions and submissions.
ja: 照会者がライセンスを十分に理解しておらず、誤った仮定で照会を提出することがしばしばあることを理解します。

source: Receive the OSRB usage form, which includes the location of the source code to audit.
ja: 監査すべきソース コードの場所を含む、OSRB利用フォームを受け取ります。

source: Receiving approval to use open source
ja: オープン ソース利用の承認受領

source: Recommend new tools to be used as part of the compliance infrastructure that will contribute to making the compliance work more efficient through automation.
ja: コンプライアンスの作業をより自動化し効率的にする、コンプライアンスの基盤の一部として利用されるべき新しいツールを推薦。

source: Recommended practices related to the various building blocks in an open source compliance program.
ja: 推奨プラクティスは、オープン ソース コンプライアンス プログラムの中の様々な不可欠要素に関連します。

source: Recommended practices that map to the various steps within an open source compliance management end-to-end process.
ja: 推奨プラクティスは、オープン ソース コンプライアンス管理の一貫プロセスの中の様々なステップに配置されます。

source: Record a summary of discussions that lead to approval or denial.
ja: 承認や却下の判断を下した議論の概要を記録します。

source: Rectify
ja: 矯正

source: Rectify 124
ja: 矯正 124

source: Reference Original Source Code
ja: 参考オリジナル ソース コード

source: Registering open source in the software inventory
ja: ソフトウェア リストへのオープン ソースの登録

source: Registration
ja: 登録

source: Registration Once a software component has been approved for usage in a product or as part of a service, its compliance ticket will be updated to reflect the approval.
ja: 登録 ソフトウェア コンポーネントが製品やサービスへの利用を承認されたら、コンプライアンス チケットは、承認を反映するように更新されます。

source: Registration 73
ja: 登録 73

source: Registration phase outcome
ja: 登録フェーズの結果

source: Registration phase outcome The component is registered in the software inventory, with the component name, version, internal owner, and the details of where the component is being used, such as product name, version, release number, etc. Step 7 .
ja: 登録フェーズの結果 コンポーネントは、コンポーネント名、バージョン、内部所有者、および製品名、バージョン、リリース番号等のコンポーネントが利用される場所の詳細などと共に、ソフトウェア一覧表に登録されます。 ステップ7 .

source: Registration phase prerequisite
ja: 登録フェーズの前提条件

source: Regularly run dependency tracking tool to verify all linkage relationships; flag any issues not in line with compliance policies
ja: 定期的に依存性追跡ツールを動作させ、全てのリンク関係を検証; 企業のポリシーで許容されていないあらゆる事柄にフラグを立てます

source: Relationships Matter
ja: 関係は大事

source: Relationships Matter 30
ja: 関係は大事 30

source: Report
ja: 報告

source: Report 123
ja: 報告 123

source: Report on compliance activities to the OSEC, including flagging issues that prevent shipping a product or service
ja: コンプライアンス活動についてOSECに報告します。これは製品やサービスの出荷を妨げている課題の注意喚起を含みます。

source: Report to OSEC on compliance activities
ja: OSECにコンプライアンス活動について報告

source: Reproduce the entire text of the license agreements for the open source code included in the product
ja: 製品に含まれているオープン ソース コードに対応するライセンスの全文を提示します。

source: Reproduce the entire text of the license agreements for the open source code included in the product.
ja: 製品に含まれているオープン ソース コードに対応するライセンスの全文を提示します。

source: Request open source compliance be completed before a merger or acquisition
ja: 会社の合併や吸収買収に先立ちオープンソース コンプライアンスが完了するよう要請

source: Request open source compliance be completed when receiving source code from outsourced development centers or third-party software vendors
ja: 外部委託した開発会ハウセンター、またはサードパーティのソフトウェア ベンダーからソースコードを受領するに先立ちオープンソース コンプライアンスが完了するよう要請

source: Require approval to include proprietary source code in OS components
ja: プロプラエタリなソースコードをオープンソースのコンポーネントに含めるには承認を必要とするようにします

source: Require approval to use OS software before committing it into product repository
ja: オープンソース ソフトウェアを使う際には製品のレポジトリにコミットする前に承認を必要とするようにします

source: Require developers to fill out a request form for any open source software they plan to incorporate into a product of software stack.
ja: 開発者がオープンソース ソフトウェアを製品やソフトウェア スタックに組み入れを計画するときは申請します。

source: Require third-party software suppliers to disclose information about open source software included in their deliverables.
ja: サードパーティのソフトウェア サプライヤに、提供物に含まれるオープンソース ソフトウェアの情報を開示させます。

source: Requiring engineers to respond in a timely fashion to compliance tickets .
ja: コンプライアンス チケットに対して適時に応答するように、技術者に要求します。

source: Resolving Issues
ja: 課題解決

source: Resolving Issues In this step of the compliance due diligence, all issues identified during the auditing step are resolved.
ja: 課題解決 コンプライアンス精査のこのステップでは、監査ステップで特定された全ての課題が解決されます。

source: Resolving Issues When source code is scanned and compliance issues are discovered and flagged, there are a number of ways to resolve issues:
ja: 課題解決 ソースコードがスキャンされて、コンプライアンス課題が発見され、フラグがつけられた時、課題解決にはいくつもの方法があります。

source: Resolving Issues 112
ja: 課題解決 112

source: Resolving Issues 70
ja: 課題解決 70

source: Resolving Issues phase outcome
ja: 課題解決フェーズの結果

source: Resolving Issues phase outcome A resolution for each of the flagged files in the report and a resolution for any flagged license conflict.
ja: 課題解決フェーズの結果 報告にあるフラグ付きのファイルの解決と、フラグ付きのライセンス矛盾の解決

source: Resolving Issues phase prerequisite
ja: 課題解決フェーズの前提条件

source: Resolving any issues uncovered by the audit
ja: 監査で検出された課題の解決

source: Resolving any issues uncovered by the audit 4.
ja: 監査で検出された課題の解決 4.

source: Respond quickly to all questions
ja: あらゆる質問への迅速な回答

source: Respond to compliance tickets without significant delays .
ja: 大きな遅延なしにコンプライアンス チケットに応答する。

source: Response time to compliance tickets
ja: コンプライアンス チケットへの応答時間

source: Response time to compliance tickets .
ja: コンプライアンス チケットへの応答時間

source: Retired Open Source Packages
ja: 使用しなくなったオープン ソース パッケージ

source: Review and approve content of OS portals
ja: オープンソースのポータルの内容をレビューし承認

source: Review and approve content of OS portals Review and approve list of obligations to fulfill Review and approve open source notices
ja: オープンソースのポータルの内容をレビューし承認 ライセンス上満たすべき義務一覧のレビューと承認 オープンソースに関する告知の承認

source: Review and approve list of obligations to fulfill
ja: ライセンス上満たすべき義務一覧のレビューと承認

source: Review and approve open source notices
ja: オープンソースに関する告知の承認

source: Review and approve proposals to release IP
ja: 知財のリリース提案 をレビューし承認

source: Review and approve proposals to release IP Review and approve proposals to release proprietary source code under an open source license.
ja: 知財のリリース提案 をレビューし承認 プロプラエタリなコードをオープンソースライセンス下でリリースする提案をレビューし承認
